"""
Файл настроек

В переменной ASCII_symbols сопоставлены наборы символов (так как высота и
ширина символов различны, есть возможность указывать набор символов) и
уровень яркости

В переменной contrast_step лежит число, равное шагу между уровнями яркости
"""
import cv2

contrast_step = 4

ASCII_symbols_width = 1
'''
ASCII_symbols = {
    0: ' ',
    1: '.',
    2: ',',
    3: '_',
    4: '-',
    5: '1',
    6: '|',
    7: '<',
    8: '>',
    9: ':',
    10: 'a',
    11: 'b',
    12: 'c',
    13: 'd',
    14: 'e',
    15: 'f',
    16: 'g',
    17: 'h',
    18: 'i',
    19: 'j',
    20: 'l',
    21: 'k',
    22: 'm',
    23: 'n',
    24: 'o',
    25: 'p',
    26: 'q',
    27: 'r',
    28: 's',
    29: 't',
    30: 'u',
    31: 'w',
    32: 'x',
    33: 'y',
    34: 'z',
    35: '~',
    36: '+',
    37: 'C',
    38: 'D',
    39: 'E',
    40: 'F',
    41: 'G',
    42: 'H',
    43: 'I',
    44: 'J',
    45: 'L',
    46: 'K',
    47: 'M',
    48: 'N',
    49: 'O',
    50: 'P',
    51: 'Q',
    52: 'R',
    53: 'S',
    54: 'T',
    55: 'U',
    56: 'A',
    57: 'X',
    58: 'Y',
    59: 'Z',
    60: '0',
    61: 'B',
    62: '2',
    63: '3',
    64: '4',
    65: '5',
    66: '6',
    67: '7',
    68: '8',
    69: '9',
    70: '*',
    71: '[',
    72: ']',
    73: '{',
    74: '}',
    75: '`',
    76: '!',
    77: '^',
    78: "?",
    79: 'W',

}
'''

ASCII_symbols = ' .,`\'"_-+<>=*^:;!()/\[]?0coCOJILabdefghijkln123456789TmADEFGHKMNPQRSUVWBXYZ@#$%&'

image_font = cv2.FONT_HERSHEY_TRIPLEX
image_font_size = 0.5
image_font_line_type = cv2.FILLED
image_font_thickness = 2

image_font_width = 12
image_font_height = 17
